archive/before-2018-11-10/2018-07-07-使用lsp-mode写C.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2018-07-07-使用lsp-mode写C</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">2018-07-07-使用lsp-mode写C</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4e33c3d">1. server</a></li>
<li><a href="#orgc6543dd">2. client</a></li>
<li><a href="#org4669a0f">3. 使用</a></li>
</ul>
</div>
</div>
<p>
都说 `lsp-mode' 写C好，我试用了一下。
</p>

<p>
Microsoft的 `Language Server Protocol' 我理解应该是一套协议，它定义了
ide或者编辑器与后端server通信的方式。
</p>

<pre class="example">
The Language Server Protocol (LSP) defines the protocol used between
an editor or IDE and a language server that provides language features
like auto complete, go to definition, find all references etc.
</pre>

<div id="outline-container-org4e33c3d" class="outline-2">
<h2 id="org4e33c3d"><span class="section-number-2">1</span> server</h2>
<div class="outline-text-2" id="text-1">
<p>
对于 <code>c/c++</code> ，<a href="https://github.com/cquery-project/cquery">cquery</a> 是一个符合lsp协议的后端，它是使用的clang来解析
的c文件。
</p>

<p>
server端没有太多说的，直接下载下来后按照 <a href="https://github.com/cquery-project/cquery/wiki/Build-%28CMake%29">教程</a> 编译就可以了。
</p>
<pre class="example">
  $ mkdir build &amp;&amp; cd build
  $ cmake .. -DCMAKE_BUILD_TYPE=release -DCMAKE_INSTALL_PREFIX=release -DCMAKE_EXPORT_COMPILE_COMMANDS=YES
  $ cmake --build . --target install
</pre>
</div>
</div>

<div id="outline-container-orgc6543dd" class="outline-2">
<h2 id="orgc6543dd"><span class="section-number-2">2</span> client</h2>
<div class="outline-text-2" id="text-2">
<p>
我在emacs中使用，需要安装 `lsp-mode' 和 `cquery' 。装好后，emacs端需要
这样设置一下：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">require</span> '<span style="color: #5fafd7;">cquery</span>)
<span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">&#36825;&#37324;&#25351;&#21040;&#32534;&#35793;&#22909;&#30340;cquery&#21487;&#25191;&#34892;&#25991;&#20214;</span>
(<span style="color: #a1db00;">setq</span> cquery-executable <span style="color: #ff4ea3;">"/home/pengpengxp/github/cquery/build/cquery"</span>)
<span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">;; Arch Linux aur/cquery-git aur/cquery</span>
<span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">(setq cquery-executable "/usr/bin/cquery")</span>

<span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">;; Log file</span>
(<span style="color: #a1db00;">setq</span> cquery-extra-args '(<span style="color: #ff4ea3;">"--log-file=/tmp/cq.log"</span>))
<span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">;; Cache directory, both relative and absolute paths are supported</span>
<span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">(setq cquery-cache-dir ".cquery_cached_index")</span>
<span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">;; Initialization options</span>
<span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">(setq cquery-extra-init-params '(:cacheFormat "msgpack"))</span>

(<span style="color: #a1db00;">setq</span> company-transformers nil company-lsp-async t company-lsp-cache-candidates nil)
(<span style="color: #a1db00;">setq</span> cquery-extra-init-params '(<span style="color: #d18aff;">:completion</span> (<span style="color: #d18aff;">:detailedLabel</span> t)))

<span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">To enable semantic highlighting:</span>
(<span style="color: #a1db00;">setq</span> cquery-sem-highlight-method 'font-lock)
<span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">alternatively, (setq cquery-sem-highlight-method 'overlay)</span>
<span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">For rainbow semantic highlighting</span>
(<span style="color: #a1db00;">cquery-use-default-rainbow-sem-highlight</span>)

<span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">user `</span><span style="color: #5fafd7; font-style: italic;">ivy</span><span style="color: #6c6c6c; font-style: italic;">' for xref show</span>
(<span style="color: #a1db00;">require</span> '<span style="color: #5fafd7;">ivy-xref</span>)
(<span style="color: #a1db00;">setq</span> xref-show-xrefs-function 'ivy-xref-show-xrefs)

(<span style="color: #a1db00;">provide</span> '<span style="color: #5fafd7;">init-lsp-cquery-mode</span>)

</pre>
</div>

<p>
还需要在c的hook中加入 <code>(lsp-cquery-enable)</code> 这一句，这里注意，是打开
<code>lsp-cquery-enable</code> 而不是 <code>lsp-mode</code> ，因为前者会去打开后者：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'c-mode-hook #'(lambda ()
                           (<span style="color: #a1db00;">interactive</span>)
                           (lsp-cquery-enable)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4669a0f" class="outline-2">
<h2 id="org4669a0f"><span class="section-number-2">3</span> 使用</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>xref-find-definitions</li>
<li>xref-find-references</li>
<li>xref-find-apropos</li>
<li>xref-pop-marker-stack</li>
<li>cquery-call-hierarchy：可以找出所有调用这个函数的地方。</li>
<li>cquery-member-hierarchy：可以找出函数中所有成员定义的地方。</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>